{
  "backend/main.mo": "Motoko actor implementing a zombie shooter backend with high score submission/retrieval, player profile tracking (kills, headshots, shots, points, level), and XP-based leveling with 55 steep thresholds. Includes access control authorization and player name sanitization.",
  "feature_evidence.json": "Feature evidence report documenting a single feature task: diagnosing and fixing the in-game audio system across GameScene.tsx, useGameAudio.ts, and audioSynthesis.ts to ensure Web Audio API AudioContext is properly initialized and all sound effects are wired to game events.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing the purpose and recent changes of each component, hook, and utility in the FPS zombie shooter frontend.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind base/components/utilities and defines CSS custom properties for light and dark theme color tokens used throughout the UI.",
  "frontend/index.html": "Minimal HTML shell for the FPS Zombie Shooter app, mounting the React app at the #root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component managing top-level screen navigation (menu, game, gameover, leaderboard, controls, profile) and passing game result data (score, wave, kills, headshots, shotsFired) between screens.",
  "frontend/src/components/ControlsScreen.tsx": "Static controls reference screen that renders a styled list of all keyboard and mouse bindings in a Borderlands toon aesthetic with a back button.",
  "frontend/src/components/Game/DesertEnvironment.tsx": "Three.js-based desert scene renderer that procedurally generates buildings with windows, trim, and parapet details, and composes the full environment including palm trees, Pack-a-Punch machine, Juggernog machine, and mountain barriers.",
  "frontend/src/components/Game/EnemyMesh.tsx": "Renders animated 3D enemy meshes (standard zombie, and likely other variants) using toon shading, with walking animations, hit flash effects, death fading, and player-facing rotation.",
  "frontend/src/components/Game/FirstPersonCamera.tsx": "Implements first-person player movement with WASD/sprint/jump controls, mouse-look, gravity, and AABB-based collision detection against procedural geometry and interactive objects.",
  "frontend/src/components/Game/GameScene.tsx": "Main game scene orchestrator that composes the 3D canvas, player camera, enemies, weapons, HUD, wave system, and handles raycasting for shooting with headshot detection.",
  "frontend/src/components/Game/HUD.tsx": "Renders the in-game heads-up display including health bar, ammo counter, crosshair, wave info, score, kill streak, points notifications, and Pack-a-Punch/Juggernog proximity prompts.",
  "frontend/src/components/Game/JuggernogMachine.tsx": "Renders an animated toon-shaded Juggernog vending machine with pulsing glow, flickering screen, and floating particle effects that deactivate after two purchases.",
  "frontend/src/components/Game/MountainBarrier.tsx": "Renders a procedural rocky mountain ring barrier using distorted cone, box, and icosahedron geometries with seeded RNG for deterministic variation and realistic stone color palettes.",
  "frontend/src/components/Game/MuzzleFlash.tsx": "Displays a brief animated muzzle flash sphere mesh at a given position that fades out over 80ms when the `active` prop is triggered.",
  "frontend/src/components/Game/PackAPunchMachine.tsx": "Renders an animated Pack-a-Punch upgrade machine with pulsing glow, flickering screen, and floating particles whose colors change based on the current upgrade tier.",
  "frontend/src/components/Game/PalmTree.tsx": "Generates a procedural palm tree with a tapered, ring-bumped trunk, drooping fronds, and a coconut cluster using seeded RNG for per-tree variation.",
  "frontend/src/components/Game/PauseOverlay.tsx": "Renders a styled full-screen pause menu overlay with a resume button that calls the `onResume` callback when clicked.",
  "frontend/src/components/Game/PickupMesh.tsx": "Renders a floating, rotating health or ammo pickup mesh that detects proximity to the player and triggers collection callbacks when within range.",
  "frontend/src/components/Game/ToonMaterial.tsx": "Provides React hooks that create and cache custom Three.js shader materials for toon shading with hit flash support and a back-face outline effect.",
  "frontend/src/components/Game/WaveOverlay.tsx": "Displays a styled HUD overlay showing wave countdown, boss warnings, or wave-cleared messages based on the current wave phase state.",
  "frontend/src/components/Game/WeaponViewModel.tsx": "Renders 3D first-person weapon view models (pistol and others) in React Three Fiber with toon shading, recoil animation, and tiered upgrade glow/sparkle effects.",
  "frontend/src/components/GameOver.tsx": "Displays the game over screen with session stats (score, wave, kills, headshots), submits stats to the backend for authenticated users, and allows leaderboard score submission.",
  "frontend/src/components/Leaderboard.tsx": "Renders the leaderboard UI showing top player scores and waves fetched via the useLeaderboard hook, with rank medals and loading/error states.",
  "frontend/src/components/MainMenu.tsx": "Renders the animated main menu with background parallax, dust motes, Internet Identity login/logout, and navigation buttons for starting the game, leaderboard, controls, and profile.",
  "frontend/src/components/PlayerProfile.tsx": "Displays the authenticated player's profile including level, XP progress bar, and lifetime stats (kills, headshots, shots fired, points) fetched from the backend.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useEnemySystem.ts": "Manages enemy spawning, damage, death, pickups, score, and points notifications for a wave-based shooter game. Exposes state and callbacks for spawning enemies (including bosses), dealing damage with headshot support, and handling pickup drops.",
  "frontend/src/hooks/useGameAudio.ts": "Provides a hook that wraps synthesized audio functions for game events such as gunshots, zombie sounds, player hits, pickups, and wave transitions. Each audio action is exposed as a memoized callback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via DFINITY's AuthClient, providing a React context and hook with login, logout, and identity state management. Includes an InternetIdentityProvider component that persists identity across page reloads.",
  "frontend/src/hooks/useJuggernogSystem.ts": "Manages the Juggernog perk system allowing up to two health upgrades purchased with in-game points, tracking purchase count and max health. Exposes purchase and reset callbacks with success/error handling.",
  "frontend/src/hooks/useLeaderboard.ts": "Fetches the high score leaderboard from the backend canister and provides a mutation to submit new scores. Uses React Query with identity-aware cache keys to keep data fresh on auth changes.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching/creating a player profile and updating it with session stats via the backend actor. Re-exports the leaderboard hook for convenience.",
  "frontend/src/hooks/useWaveSystem.ts": "Controls wave progression through phases (menu, countdown, active, cleared, gameover), handling countdown timers, enemy spawning triggers, and wave-clear detection. Wave difficulty scales with wave number, with boss waves every fifth wave.",
  "frontend/src/hooks/useWeaponSystem.ts": "Manages weapon state including current weapon, ammo, reloading, recoil, and upgrade tiers with associated damage multipliers. Exposes callbacks for firing, reloading, switching weapons, and upgrading, plus keyboard shortcut handling.",
  "frontend/src/index.css": "Global CSS file that defines a Desert Borderlands design system using Tailwind, custom OKLCH CSS variables, and utility/component classes for toon-styled buttons, panels, and HUD text with Bangers and Oswald fonts.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/shaders/sandShader.ts": "GLSL vertex and fragment shaders for a procedural sand/dune terrain, using value noise for height displacement and warm sandy color gradients with stripe patterns.",
  "frontend/src/shaders/skyShader.ts": "GLSL shaders for a desert sky dome, blending burnt orange at the horizon to deep red-purple at the zenith with a sun glow effect near the horizon.",
  "frontend/src/shaders/toonShader.ts": "GLSL shaders implementing Borderlands-style cel shading with 4-step posterized diffuse lighting, rim highlights, hit flash inversion, and a solid dark outline pass.",
  "frontend/src/types/enemy.ts": "TypeScript interfaces defining Enemy and Pickup data shapes, including position, health, attack stats, and state flags for hit/death animations.",
  "frontend/src/types/weapon.ts": "TypeScript types and configuration for the three weapons (pistol, shotgun, assault rifle), including fire rate, damage, ammo, reload time, and upgrade tier constants.",
  "frontend/src/utils/audioSynthesis.ts": "Web Audio API utility that procedurally synthesizes gunshot sound effects (pistol, shotgun, assault rifle) using noise buffers, oscillators, and gain envelopes, with an unlock helper for browser autoplay policies.",
  "frontend/src/utils/levelSystem.ts": "Frontend level system utility mirroring backend XP thresholds for levels 1–55, exposing helpers to calculate current level, XP boundaries, and percentage progress toward the next level.",
  "frontend/src/utils/proceduralGeometry.ts": "Procedural geometry utilities that use a seeded RNG to generate deterministic building/ruin/barrier layout data, collision AABBs, and mountain ring segment data for the game arena.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those values via sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (colors, fonts, shadows, border radii, keyframe animations) and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing a fix request to diagnose and repair the in-game audio system (AudioContext lifecycle and sound-effect wiring), with one known issue that sounds are currently not working."
}