{
  "backend/main.mo": "Motoko actor implementing the game backend with high score tracking (top 10), player profile management, XP/level calculation, and role-based access control for score submission and profile updates.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (zombie mesh redesigns, animations, UI changes, etc.) to their affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of each frontend source file, describing their roles and recent changes across game components, hooks, and UI screens.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines CSS custom property design tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the FPS Zombie Shooter app that mounts the React root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component managing screen navigation (menu, game, gameover, leaderboard, controls, profile) and passing game result data (score, wave, kills, headshots, shotsFired) between screens.",
  "frontend/src/components/ControlsScreen.tsx": "Static controls reference screen rendered in Borderlands toon style that lists all keyboard and mouse bindings with a back button.",
  "frontend/src/components/Game/DesertEnvironment.tsx": "3D desert scene component that renders procedurally generated buildings with windows and trim, palm trees, a Pack-a-Punch machine, mountain barriers, sand, and sky using toon shading materials.",
  "frontend/src/components/Game/EnemyMesh.tsx": "Renders animated 3D enemy meshes (zombie variants) using toon shading, with walking animations, hit flash effects, and death fade-out transitions driven by useFrame.",
  "frontend/src/components/Game/FirstPersonCamera.tsx": "Implements first-person player movement with WASD/sprint/jump controls, mouse-look, AABB collision detection against procedural geometry and game objects, and auto-fire input handling.",
  "frontend/src/components/Game/GameScene.tsx": "Main game scene orchestrator that composes the 3D canvas with enemies, weapons, HUD, wave system, raycasting-based shooting with headshot detection, and game-over logic.",
  "frontend/src/components/Game/HUD.tsx": "Renders the 2D heads-up display including health bar, ammo counter, crosshair, wave info, score, kill streak, points notifications, and Pack-a-Punch upgrade prompts.",
  "frontend/src/components/Game/MountainBarrier.tsx": "Generates and renders a procedural rocky mountain ring barrier using distorted cone, box, and icosahedron geometries with seeded randomness for a deterministic toon-shaded environment boundary.",
  "frontend/src/components/Game/MuzzleFlash.tsx": "Displays a brief animated muzzle flash sphere at a given position that fades out over ~80ms when the weapon fires.",
  "frontend/src/components/Game/PackAPunchMachine.tsx": "Renders an animated 3D Pack-a-Punch upgrade machine in the game arena with tier-based color schemes, pulsing glow effects, screen flicker, and floating particles using React Three Fiber.",
  "frontend/src/components/Game/PalmTree.tsx": "Procedurally generates a realistic 3D palm tree mesh with a tapered/swaying trunk, drooping fronds, and coconut clusters using seeded RNG for deterministic per-tree variation.",
  "frontend/src/components/Game/PauseOverlay.tsx": "Displays a styled full-screen pause menu overlay with a resume button and instructions when the game is paused.",
  "frontend/src/components/Game/PickupMesh.tsx": "Renders a floating, rotating 3D pickup item (health or ammo) that detects player proximity and triggers collection callbacks with appropriate effects.",
  "frontend/src/components/Game/ToonMaterial.tsx": "Provides React hooks that create and cache custom Three.js shader materials for a toon/cel-shading effect and a back-face outline effect.",
  "frontend/src/components/Game/WaveOverlay.tsx": "Displays a styled UI overlay showing wave countdown, boss warnings, and wave-cleared messages based on the current wave phase state.",
  "frontend/src/components/Game/WeaponViewModel.tsx": "Renders first-person 3D weapon view models with recoil/reload animations and upgrade-tier visual effects including glow overlays and gold sparkle particles.",
  "frontend/src/components/GameOver.tsx": "Displays the game-over screen with final stats, leaderboard score submission, and profile stat updates to the backend when the player is authenticated.",
  "frontend/src/components/Leaderboard.tsx": "Renders a styled leaderboard UI showing top player scores and wave numbers, fetched via the useLeaderboard hook, with special styling for the top 3 ranks.",
  "frontend/src/components/MainMenu.tsx": "Displays the main menu screen with game title, navigation buttons, and an Internet Identity authentication panel for sign-in/sign-out.",
  "frontend/src/components/PlayerProfile.tsx": "Shows the authenticated player's profile including level, XP progress bar, and stat cards, fetched via useGetOrCreateProfile.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useEnemySystem.ts": "Manages enemy and pickup state for the game, including spawning enemies, applying damage with headshot logic, tracking score/points, and emitting floating points notifications.",
  "frontend/src/hooks/useGameAudio.ts": "Provides memoized callbacks for playing synthesized game sound effects (gunshots, zombie sounds, pickups, wave events) based on weapon type or game event.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity, and status state to child components.",
  "frontend/src/hooks/useLeaderboard.ts": "React Query hook that fetches high scores from the backend actor and provides a mutation to submit a new score, invalidating the leaderboard cache on success.",
  "frontend/src/hooks/useQueries.ts": "Aggregates React Query hooks for player profile management: re-exports useLeaderboard, and provides useGetOrCreateProfile and useUpdateProfile for authenticated profile fetching and updating.",
  "frontend/src/hooks/useWaveSystem.ts": "Manages wave-based game progression with phases (menu, countdown, active, cleared, gameover), handling countdown timers, enemy spawning parameters, and wave-clear detection based on active enemy count.",
  "frontend/src/hooks/useWeaponSystem.ts": "Manages weapon state including firing, reloading, switching, recoil, and upgrade tiers for three weapons (pistol, shotgun, assault rifle), with keyboard input handling for weapon selection.",
  "frontend/src/index.css": "Global stylesheet defining a desert/Borderlands-themed design system with custom CSS variables, Tailwind integration, and reusable component classes (toon-btn, toon-panel, hud-text) using Bangers and Oswald fonts.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/shaders/sandShader.ts": "GLSL shaders for a procedural sand terrain: the vertex shader applies value-noise-based dune displacement, and the fragment shader renders warm sandy tones with subtle stripe patterns.",
  "frontend/src/shaders/skyShader.ts": "GLSL shaders for a desert sky dome that blends burnt orange at the horizon to deep red-purple at the zenith, with an added sun glow effect near the horizon.",
  "frontend/src/shaders/toonShader.ts": "GLSL shaders implementing a Borderlands-style cel-shading effect with 4-step posterized diffuse lighting, rim highlights, hit-flash inversion, and a solid dark outline pass.",
  "frontend/src/types/enemy.ts": "TypeScript type definitions for Enemy (with health, position, attack, and state fields) and Pickup (health or ammo collectibles) used in the game.",
  "frontend/src/types/weapon.ts": "TypeScript type definitions and configuration constants for the three weapons (pistol, shotgun, assault rifle), including fire rate, damage, ammo, reload time, upgrade costs, and damage multipliers.",
  "frontend/src/utils/audioSynthesis.ts": "Provides procedural Web Audio API sound synthesis functions for game weapons (pistol, shotgun, assault rifle) and zombie growls using noise buffers, oscillators, and gain/filter envelopes.",
  "frontend/src/utils/levelSystem.ts": "Implements a 1–55 level progression system with XP thresholds using the formula `100 + i*(i+1)*80`, exposing helpers to calculate current level, XP boundaries, and percentage progress to the next level.",
  "frontend/src/utils/proceduralGeometry.ts": "Generates deterministic procedural level geometry data (buildings, ruins, barriers, rubble, mountain ring segments) using a seeded RNG, and derives axis-aligned collision bounding boxes for player collision detection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive parameters from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom desert/zombie-game theme with oklch color tokens, toon-shadow box shadows, custom fonts (Bangers, Oswald), and keyframe animations for hit flashes, damage overlays, and accordion transitions.",
  "project_state.json": "Project state manifest tracking the current version, existing implemented features (CoD-style zombie mesh redesigns and lurch animations), and a pending feature request to further improve zombie models."
}