{
  "backend/main.mo": "Motoko actor implementing the game backend with high score submission/retrieval (top 10), player profile management, XP/level calculation, and role-based access control using a MixinAuthorization pattern.",
  "feature_evidence.json": "Feature evidence report listing three confirmed high-confidence features all targeting WeaponViewModel.tsx: realistic first-person hands/arms for all weapons, a redesigned pump-action shotgun model, and a redesigned semi-automatic pistol model.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of every frontend source file, serving as a build-planning reference for the project's frontend components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom property design tokens for light and dark themes covering colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the FPS Zombie Shooter app that mounts the React root div and loads the Vite/TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component managing top-level screen routing (menu, game, gameover, leaderboard, controls, profile) and passing game result state between screens.",
  "frontend/src/components/ControlsScreen.tsx": "Static controls reference screen rendered in Borderlands toon style that lists all keyboard and mouse bindings with a back button.",
  "frontend/src/components/Game/DesertEnvironment.tsx": "Three.js React component that renders the full desert game environment including procedurally placed intact buildings with windows and trim, palm trees, rubble, the Pack-a-Punch machine, and a mountain barrier.",
  "frontend/src/components/Game/EnemyMesh.tsx": "Renders 3D toon-shaded enemy meshes (StandardZombie and BossZombie) with animations for walking bob, hit flash, and death fade using React Three Fiber.",
  "frontend/src/components/Game/FirstPersonCamera.tsx": "Implements first-person player movement with keyboard/mouse input, gravity, jumping, sprinting, and AABB-based collision detection against the environment and props.",
  "frontend/src/components/Game/GameScene.tsx": "Main game scene component that composes the 3D environment, enemies, weapons, HUD, and game systems (waves, audio, pickups), handling raycasting for shooting and headshot detection.",
  "frontend/src/components/Game/HUD.tsx": "Renders the in-game heads-up display including health bar, ammo counter, crosshair, wave info, score, kill streak, points notifications, and Pack-a-Punch upgrade prompts.",
  "frontend/src/components/Game/MountainBarrier.tsx": "Procedurally generates and renders a ring of rocky mountain peaks using distorted cone, box, and icosahedron geometries with deterministic seeded RNG for a consistent visual barrier.",
  "frontend/src/components/Game/MuzzleFlash.tsx": "Renders a brief animated muzzle flash sphere at a given position that fades out over ~80ms when the weapon fires.",
  "frontend/src/components/Game/PackAPunchMachine.tsx": "Renders an animated 3D Pack-a-Punch upgrade machine in the game arena with tier-based color schemes, pulsing glow effects, floating particles, and exported position/collision constants.",
  "frontend/src/components/Game/PalmTree.tsx": "Procedurally generates a realistic 3D palm tree mesh with a seeded-RNG tapered trunk, drooping fronds, and a coconut cluster, supporting per-tree variation via a seed prop.",
  "frontend/src/components/Game/PauseOverlay.tsx": "Displays a styled full-screen pause menu overlay with a 'PAUSED' title and a resume button that calls the provided onResume callback.",
  "frontend/src/components/Game/PickupMesh.tsx": "Renders a floating, rotating 3D pickup item (health or ammo) and detects player proximity to trigger collection callbacks and apply the appropriate effect.",
  "frontend/src/components/Game/ToonMaterial.tsx": "Provides two React hooks—useToonMaterial and useOutlineMaterial—that create and cache custom Three.js ShaderMaterials for a toon-shading and outline rendering effect.",
  "frontend/src/components/Game/WaveOverlay.tsx": "Displays a styled HUD overlay for wave transitions, showing countdown timers, boss warnings, and wave-cleared messages based on the current WaveState phase.",
  "frontend/src/components/Game/WeaponViewModel.tsx": "Renders first-person 3D weapon view models with recoil animation, reload states, and tier-based upgrade glow/sparkle effects for multiple weapon types.",
  "frontend/src/components/GameOver.tsx": "Displays the game-over screen with final stats, submits session statistics to the backend for authenticated users, and allows leaderboard score submission by name.",
  "frontend/src/components/Leaderboard.tsx": "Renders a styled leaderboard UI showing top player scores and wave numbers, with medal icons for the top 3 ranks and a loading/empty state, using data from the useLeaderboard hook.",
  "frontend/src/components/MainMenu.tsx": "Displays the main menu screen with game title, navigation buttons, and an Internet Identity authentication panel in the top-right corner for sign-in/sign-out.",
  "frontend/src/components/PlayerProfile.tsx": "Shows the authenticated player's profile including level, XP progress bar, and stat cards (total points, games played, etc.), fetched via useGetOrCreateProfile.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes due to identity updates.",
  "frontend/src/hooks/useEnemySystem.ts": "Manages enemy and pickup state for the game, providing functions to spawn enemies, apply damage with headshot support, track score/points, and display floating points notifications.",
  "frontend/src/hooks/useGameAudio.ts": "Provides memoized callbacks for playing synthesized game sound effects (gunshots by weapon type, zombie sounds, player hit, pickup, and wave events).",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useLeaderboard.ts": "React Query hook that fetches high scores from the backend actor and provides a mutation to submit a new score, invalidating the leaderboard cache on success.",
  "frontend/src/hooks/useQueries.ts": "Aggregates React Query hooks for player profile management: re-exports useLeaderboard, and provides useGetOrCreateProfile and useUpdateProfile for authenticated profile fetching and updating.",
  "frontend/src/hooks/useWaveSystem.ts": "Manages wave-based game progression with phases (menu, countdown, active, cleared, gameover), handling countdown timers, enemy spawning parameters, and wave-clear detection based on active enemy count.",
  "frontend/src/hooks/useWeaponSystem.ts": "Manages weapon state including firing, reloading, switching, recoil, and upgrade tiers for three weapons (pistol, shotgun, assault rifle), with keyboard input support for weapon switching.",
  "frontend/src/index.css": "Global CSS defining a desert/Borderlands-themed design system with custom OKLCH color tokens, Tailwind layers, and reusable toon-style component classes (buttons, panels, HUD text).",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/shaders/sandShader.ts": "GLSL shaders for a procedural sand terrain: the vertex shader applies value-noise dune displacement, and the fragment shader renders warm sandy tones with a subtle stripe pattern.",
  "frontend/src/shaders/skyShader.ts": "GLSL shaders for a desert sky dome, blending burnt-orange horizon to deep red-purple zenith with a sun glow effect near the horizon.",
  "frontend/src/shaders/toonShader.ts": "GLSL shaders implementing a Borderlands-style toon shading effect with 4-step posterized diffuse lighting, rim light, hit flash, and a solid dark outline pass.",
  "frontend/src/types/enemy.ts": "TypeScript type definitions for Enemy (position, health, attack, state flags) and Pickup (health/ammo collectibles) used in the game.",
  "frontend/src/types/weapon.ts": "Defines TypeScript types and configuration constants for the three weapons (pistol, shotgun, assault rifle), including fire rate, damage, ammo, reload time, upgrade costs, and damage multipliers.",
  "frontend/src/utils/audioSynthesis.ts": "Provides procedural Web Audio API sound synthesis functions for game weapons (pistol, shotgun, assault rifle) and zombie growl using noise buffers, oscillators, filters, and gain envelopes.",
  "frontend/src/utils/levelSystem.ts": "Implements a 1–55 level progression system mirroring backend XP thresholds, with helpers to calculate current level, XP boundaries, and percentage progress toward the next level.",
  "frontend/src/utils/proceduralGeometry.ts": "Generates deterministic procedural level geometry data including building/ruin/barrier placements, collision AABBs, and mountain ring segments for the 3D arena using a seeded RNG.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (desert-themed colors, toon box shadows, custom fonts), keyframe animations (hit-flash, damage-flash, wave-in), and plugin registrations.",
  "project_state.json": "Tracks the FPS Zombie Shooter project state including completed features (realistic weapon view models, first-person hands/arms) and pending feature requests for improved hand/arm rendering and weapon model realism."
}