{
  "backend/main.mo": "Motoko actor implementing the game backend with high score submission/retrieval (top 10), player profile management (kills, headshots, shots, points, level), and XP-based level calculation, protected by role-based access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (realistic pistol, shotgun, and assault rifle weapon view model redesigns) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of every frontend source file, serving as a human-readable index of what each component, hook, and utility does.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom property design tokens for light and dark themes (colors, radius, chart palette, sidebar) and applies base border and background styles.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, setting the page title to 'FPS Zombie Shooter' and mounting the React root via /src/main.tsx.",
  "frontend/src/App.tsx": "Root React component managing top-level screen routing (menu, game, gameover, leaderboard, controls, profile) and passing game result data (score, wave, kills, headshots, shotsFired) between screens.",
  "frontend/src/components/ControlsScreen.tsx": "Static controls reference screen that renders a styled list of all keyboard/mouse bindings in a Borderlands toon aesthetic with a back button.",
  "frontend/src/components/Game/DesertEnvironment.tsx": "Three.js React component that renders the full desert game environment including procedurally placed intact buildings with windows and trim, palm trees, a Pack-a-Punch machine, mountain barriers, sand, and sky shaders.",
  "frontend/src/components/Game/EnemyMesh.tsx": "Renders 3D toon-shaded enemy meshes (StandardZombie and BossZombie) with animations for walking bob, hit flash, and death fade using React Three Fiber.",
  "frontend/src/components/Game/FirstPersonCamera.tsx": "Implements first-person player movement with keyboard/mouse input, gravity, jumping, sprinting, and AABB-based collision detection against the environment and obstacles.",
  "frontend/src/components/Game/GameScene.tsx": "Main game scene component that composes all subsystems (enemies, weapons, waves, audio, HUD) and handles raycasting for shooting with headshot detection and damage calculation.",
  "frontend/src/components/Game/HUD.tsx": "Renders the in-game heads-up display including health bar, ammo counter, weapon selector, crosshair, score, wave info, kill streak, and points notifications.",
  "frontend/src/components/Game/MountainBarrier.tsx": "Procedurally generates and renders a ring of rocky mountain peaks using distorted cone, box, and icosahedron geometries with seeded randomness for a deterministic stone barrier.",
  "frontend/src/components/Game/MuzzleFlash.tsx": "Displays a brief animated muzzle flash sphere at a given position that fades out over 80ms when the weapon fires.",
  "frontend/src/components/Game/PackAPunchMachine.tsx": "Renders an animated 3D Pack-a-Punch upgrade machine in the game arena with tier-based color schemes, pulsing glow effects, screen flicker, and floating particles using React Three Fiber.",
  "frontend/src/components/Game/PalmTree.tsx": "Procedurally generates a realistic 3D palm tree mesh with a tapered/curved trunk, drooping fronds, and coconut clusters using seeded RNG for deterministic per-tree variation.",
  "frontend/src/components/Game/PauseOverlay.tsx": "Displays a styled full-screen pause menu overlay with a resume button and instructions to unpause the game.",
  "frontend/src/components/Game/PickupMesh.tsx": "Renders floating, rotating health or ammo pickup items in the 3D scene and handles proximity-based collection by the player.",
  "frontend/src/components/Game/ToonMaterial.tsx": "Provides custom React hooks that create and cache Three.js toon-shaded and outline shader materials for stylized cel-shading effects.",
  "frontend/src/components/Game/WaveOverlay.tsx": "Displays a UI overlay showing wave countdown, boss warnings, and wave-cleared messages based on the current wave phase state.",
  "frontend/src/components/Game/WeaponViewModel.tsx": "Renders first-person weapon view models (pistol and others) with recoil animation, reload states, and tier-based glow/sparkle upgrade visual effects.",
  "frontend/src/components/GameOver.tsx": "Displays the game-over screen with final stats, submits session statistics to the backend for authenticated users, and allows leaderboard score submission.",
  "frontend/src/components/Leaderboard.tsx": "Renders a styled leaderboard UI showing top player scores and wave numbers, with gold/silver/bronze rank highlights and a loading/empty state, using data from the useLeaderboard hook.",
  "frontend/src/components/MainMenu.tsx": "Displays the main menu screen with game title, navigation buttons, and an Internet Identity authentication panel (sign in/out) in the top-right corner.",
  "frontend/src/components/PlayerProfile.tsx": "Shows the authenticated player's profile including level, XP progress bar, and stat cards, fetched via useGetOrCreateProfile and the level utility functions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useEnemySystem.ts": "Manages enemy and pickup state for the game, providing functions to spawn enemies, apply damage with headshot support, track score/points, and emit floating points notifications.",
  "frontend/src/hooks/useGameAudio.ts": "Provides memoized callbacks for playing synthesized game sound effects (gunshots by weapon type, zombie sounds, player hit, pickup, and wave events).",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useLeaderboard.ts": "React Query hook that fetches high scores from the backend actor and provides a mutation to submit a new score, invalidating the leaderboard cache on success.",
  "frontend/src/hooks/useQueries.ts": "Re-exports useLeaderboard and provides two hooks: useGetOrCreateProfile (fetches/creates an authenticated player profile) and useUpdateProfile (mutation to update profile with session stats).",
  "frontend/src/hooks/useWaveSystem.ts": "Manages wave-based game progression with phases (menu, countdown, active, cleared, gameover), handling countdown timers, enemy spawning parameters, and wave-clear detection based on active enemy count.",
  "frontend/src/hooks/useWeaponSystem.ts": "Manages weapon state including firing, reloading, weapon switching, recoil, and upgrade tiers, with keyboard input support and effective damage calculation based on upgrade multipliers.",
  "frontend/src/index.css": "Global CSS defining a Desert Borderlands design system with custom OKLCH color tokens, Bangers/Oswald fonts, and reusable toon-style component classes (buttons, panels, HUD text).",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/shaders/sandShader.ts": "GLSL shaders for a procedural sand terrain, using value noise for dune displacement in the vertex shader and warm sandy color gradients with stripe patterns in the fragment shader.",
  "frontend/src/shaders/skyShader.ts": "GLSL shaders for a desert sky dome, blending burnt orange to deep red-purple from horizon to zenith with a sun glow effect near the horizon.",
  "frontend/src/shaders/toonShader.ts": "GLSL shaders implementing Borderlands-style cel shading with 4-step posterized diffuse lighting, rim highlights, hit flash effect, and a solid dark outline pass.",
  "frontend/src/types/enemy.ts": "TypeScript interfaces defining Enemy (with health, position, attack, and state flags) and Pickup (health/ammo collectibles) types used in the game.",
  "frontend/src/types/weapon.ts": "Defines weapon types, configs, and state interfaces for three weapons (pistol, shotgun, assault rifle), including upgrade cost/damage multiplier constants and per-weapon stat configurations.",
  "frontend/src/utils/audioSynthesis.ts": "Provides procedural Web Audio API sound synthesis functions for weapon fire (pistol, shotgun, assault rifle) and zombie growl effects using noise buffers, oscillators, and gain/filter envelopes.",
  "frontend/src/utils/levelSystem.ts": "Implements a 1–55 level progression system mirroring backend XP thresholds, with helpers to calculate current level, XP boundaries, and percentage progress toward the next level.",
  "frontend/src/utils/proceduralGeometry.ts": "Generates deterministic procedural building/ruin/barrier layout data and collision AABBs for the game arena, plus mountain ring segment data for the perimeter barrier, using a seeded RNG.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (desert/game color palette, toon-shadow box shadows, Bangers/Oswald fonts, hit-flash and damage-flash keyframes) and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest tracking the current version, feature list, and architectural notes for a 3D RPG/shooter game focused on realistic first-person weapon models with toon shading."
}