{
  "kind": "build_request",
  "title": "Increase XP required per player level-up",
  "projectName": "FPS Zombie Shooter",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Significantly increase the XP thresholds required to advance each player level in the backend XP/level progression system. The XP cost per level should scale much more steeply so players need considerably more accumulated XP to reach higher levels.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "man braucht deutlich mehr XP bei jedem spieler level aufstieg"
        ]
      },
      "acceptanceCriteria": [
        "Each level requires substantially more XP than in the previous configuration (e.g., at least 2–3× higher thresholds overall).",
        "The XP thresholds increase steeply with each level so higher levels require disproportionately more XP.",
        "Existing player XP values are preserved; only the thresholds change, so players may find their effective level has changed accordingly."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the frontend level progression system in `frontend/src/utils/levelSystem.ts` to mirror the new backend XP thresholds exactly, so that the displayed level, XP progress bar, and XP boundaries in the PlayerProfile screen remain consistent with backend calculations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "man braucht deutlich mehr XP bei jedem spieler level aufstieg"
        ]
      },
      "acceptanceCriteria": [
        "The XP thresholds in `levelSystem.ts` match the updated backend thresholds for all 55 levels.",
        "The PlayerProfile XP progress bar and current level display correctly reflect the new thresholds.",
        "Level calculation utility functions (current level, XP boundaries, percentage progress) return correct values under the new thresholds."
      ]
    }
  ],
  "constraints": [
    "Do not change the level cap (1–55) or the overall level structure.",
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui."
  ],
  "nonGoals": [
    "Changing the amount of XP awarded per kill or per game session.",
    "Adding new levels beyond the existing cap.",
    "Resetting or wiping existing player XP data."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}