{
  "kind": "build_request",
  "title": "Fix game audio / sound effects not working",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Diagnose and fix the audio system so that all in-game sound effects (gunshots for pistol, shotgun, and assault rifle; zombie growls; player hit sounds; pickup sounds; wave start/clear events) play correctly during gameplay. The root cause is likely in audioSynthesis.ts or useGameAudio.ts – ensure the Web Audio API AudioContext is properly created, resumed after a user gesture (browsers require a user interaction before audio can play), and that all synthesized sound callbacks are wired up and invoked at the correct game events in GameScene.tsx.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "die sounds funktionieren aktuell nicht"
        ]
      },
      "acceptanceCriteria": [
        "Gunshot sound plays each time the player fires any weapon (pistol, shotgun, assault rifle).",
        "Zombie growl/noise plays when enemies are active.",
        "Player hit sound plays when the player takes damage.",
        "Pickup sound plays when a health or ammo pickup is collected.",
        "Wave start and wave cleared audio cues play at the correct wave phase transitions.",
        "No browser console errors related to AudioContext or suspended audio state.",
        "Audio works after the first user interaction (click/keypress) without requiring a page reload."
      ]
    }
  ],
  "constraints": [
    "Do not modify any file listed under frontend.immutablePaths.",
    "Keep all audio synthesis logic inside frontend/src/utils/audioSynthesis.ts and frontend/src/hooks/useGameAudio.ts; do not introduce external audio libraries or audio asset files."
  ],
  "nonGoals": [
    "Adding new sound effects not already designed in the system.",
    "Backend changes.",
    "Visual or gameplay changes unrelated to audio."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}